<a href="https://colab.research.google.com/github/ArkSze78/Data-Science_Bootcamp/blob/main/02_analiza_danych/01_pandas_intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

* @author: krakowiakpawel9@gmail.com  
* @site: e-smartdata.org

### Pandas
>Strona biblioteki: [https://pandas.pydata.org/](https://pandas.pydata.org/)  
>Dokumentacja: [https://pandas.pydata.org/pandas-docs/stable/](https://pandas.pydata.org/pandas-docs/stable/)
>
>Podstawowa biblioteka do analizy danych w języku Python.
>
>Aby zainstalować bibliotekę Pandas użyj polecenia poniżej:
```
pip install pandas
```
### Spis treści:
1. [Podstawowe struktury danych: pd.Series](#a1)
2. [Podstawowe struktury danych: pd.DataFrame](#a2)
3. [Selekcja kolumn](#a3)

In [1]:
import pandas as pd
pd.__version__

'2.2.2'

### <a name='a1'></a>  Podstawowe struktury danych: pd.Series

In [2]:
s = pd.Series(data=[3, 2, 4, 6])
s

0    3
1    2
2    4
3    6
dtype: int64

In [3]:
s = pd.Series(data=[3, 2, 4, 6], index=['a', 'b', 'c', 'd'], name='sample')
s

a    3
b    2
c    4
d    6
Name: sample, dtype: int64

In [4]:
s = pd.Series(data=[3., 2, 4, 6], index=['a', 'b', 'c', 'd'], name='sample')
s

a    3.0
b    2.0
c    4.0
d    6.0
Name: sample, dtype: float64

In [5]:
import numpy as np
s = pd.Series(data=[3., np.nan, 4, 6]
    ,index=['a', 'b', 'c', 'd'], name='sample')
s

a    3.0
b    NaN
c    4.0
d    6.0
Name: sample, dtype: float64

In [6]:
s = pd.Series(data=[True, False, False])
s

0     True
1    False
2    False
dtype: bool

In [7]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start='20200101', periods=10), name='sample')
s

2020-01-01    10
2020-01-02    11
2020-01-03    12
2020-01-04    13
2020-01-05    14
2020-01-06    15
2020-01-07    16
2020-01-08    17
2020-01-09    18
2020-01-10    19
Freq: D, Name: sample, dtype: int64

In [8]:
s.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [9]:
s = pd.Series(data=['python', 'java', 'sql'], name='languages')
s

0    python
1      java
2       sql
Name: languages, dtype: object

In [10]:
type(s)

pandas.core.series.Series

In [11]:
# atrybuty objektow typu Series
s.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
s.values

array(['python', 'java', 'sql'], dtype=object)

In [13]:
s.dtypes

dtype('O')

In [14]:
s.shape

(3,)

In [26]:
price = pd.Series(data={'Apple': 200, 'CD Project': 60, 'Amazon': 1900, 'KGHM': np.nan})
price

Apple          200.0
CD Project      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

Wycinanie danych z obietku typu Series

In [16]:
# zwracanie wartosci po kluczu
price['CD Project']

np.int64(60)

In [17]:
# zwracanie po indeksie
price[1]

<ipython-input-17-7ce2be13fd35>:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  price[1]

np.int64(60)

Podstawowe funkcje w bibliotece pandas do analizy danych

In [18]:
price.count()

np.int64(3)

In [27]:
price.value_counts()
# bada ilosc wystapien poszczegolnych wartosci

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [20]:
price.sum()

np.int64(2160)

In [21]:
price.max()

1900

In [22]:
price.min()

60

In [23]:
price.std()

1024.3046421841502

In [25]:
# describe() - funkcja opisuje obiekt Series i zwracajac dane statystyczne (min, max, kwartyle, count...)
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

In [28]:
# co gdy w jednym z wierszy jest wartosc nan
price.value_counts(dropna=False)

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [29]:
# wybieranie top n ilosci obiektow
price.nlargest(n=2)

Amazon    1900.0
Apple      200.0
dtype: float64

In [30]:
price.nsmallest(n=2)

CD Project     60.0
Apple         200.0
dtype: float64

In [31]:
# zwracanie rankingu danych
price.rank()

Apple         2.0
CD Project    1.0
Amazon        3.0
KGHM          NaN
dtype: float64

In [32]:
# sortowanie danych
price.sort_values()

CD Project      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [33]:
price.sort_values(ascending=False)

Amazon        1900.0
Apple          200.0
CD Project      60.0
KGHM             NaN
dtype: float64

### <a name='a2'></a>  Podstawowe struktury danych: pd.DataFrame

### <a name='a3'> </a> Selekcja kolumn